<?php
namespace App\Core;

/**
 * Класс для конвертирования фраз с английского языка на русский(кириллица) и обратно
 */
class TranslateConverterCyrillic {
    public static $CONVERTER_TO_ENGLISH = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'eo',  'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'ye',  'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => 'mz',  'ы' => 'y',   'ъ' => 'tz',
        'э' => 'ei',  'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'EO',  'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'YE',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => 'MZ',  'Ы' => 'Y',   'Ъ' => 'TZ',
        'Э' => 'EI',   'Ю' => 'Yu',  'Я' => 'Ya',
    );

    public static $CONVERTER_TO_RUSSIAN = array(
        'a' => 'а',   'b' => 'б',   'v' => 'в',
        'g' => 'г',   'd' => 'д',   'e' => 'е',
        'eo' => 'ё',  'zh' => 'ж',  'z' => 'з',
        'i' => 'и',   'ye' => 'й',  'k' => 'к',
        'l' => 'л',   'm' => 'м',   'n' => 'н',
        'o' => 'о',   'p' => 'п',   'r' => 'р',
        's' => 'с',   't' => 'т',   'u' => 'у',
        'f' => 'ф',   'h' => 'х',   'c' => 'ц',
        'ch' => 'ч',  'sh' => 'ш',  'sch' => 'щ',
        'mz' => 'ь',  'y' => 'ы',   'tz' => 'ъ',
        'ei' => 'э',  'yu' => 'ю', 'ya' => 'я',

        'A' => 'А',   'B' => 'Б',   'V' => 'В',
        'G' => 'Г',   'D' => 'Д',   'E' => 'Е',
        'EO' => 'Ё',  'Zh' => 'Ж',  'Z' => 'З',
        'I' => 'И',   'YE' => 'Й',  'K' => 'К',
        'L' => 'Л',   'M' => 'М',   'N' => 'Н',
        'O' => 'О',   'P' => 'П',   'R' => 'Р',
        'S' => 'С',   'T' => 'Т',   'U' => 'У',
        'F' => 'Ф',   'H' => 'Х',   'C' => 'Ц',
        'Ch' => 'Ч',  'Sh' => 'Ш',  'Sch' => 'Щ',
        'MZ' => 'ь',  'Y' => 'Ы',   'TZ' => 'Ъ',
        'EI' => 'Э',  'Yu' => 'ю',  'Ya' => 'Я',
    );

    public static function translateToRussian($text) {
        return strtr($text, self::$CONVERTER_TO_RUSSIAN);
    }

    public static function translateToEnglish($text) {
        return strtr($text, self::$CONVERTER_TO_ENGLISH);
    }
}